"""
Написать функцию count_char, которая принимает строковое значение STR_VAL,
из которого создает и возвращает словарь, следующего вида:
{
    'буква': количество-вхождений-в-строку
}

например: {
    'p': 2,
    'y': 1,
    ...
}

Нельзя пользоваться collections.Counter!
"""
STR_VAL = 'python is the fastest-growing major programming language'


def count_char(string):
    string = string.replace(' ', '')
    dict_string = {key: string.count(key) for key in string}
    return dict_string


print(count_char('python is the fastest-growing major programming language'))
